spec/support/mvi/find_candidate_inactive_mhv_ids.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
  xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" 
  xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
  xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
  <env:Header/>
  <env:Body>
    <idm:PRPA_IN201306UV02 ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd" 
      xmlns:idm="http://vaww.oed.oit.va.gov" 
      xmlns="urn:hl7-org:v3">
      <id extension="WSDOC1908141602159601500112018" root="2.16.840.1.113883.4.349"/>
      <creationTime value="20190814160216"/>
      <versionCode code="4.1"/>
      <interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/>
      <processingCode code="T"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="NE"/>
      <receiver typeCode="RCV">
        <device determinerCode="INSTANCE" classCode="DEV">
          <id extension="200VGOV" root="2.16.840.1.113883.4.349"/>
        </device>
      </receiver>
      <sender typeCode="SND">
        <device determinerCode="INSTANCE" classCode="DEV">
          <id extension="200M" root="2.16.840.1.113883.4.349"/>
        </device>
      </sender>
      <acknowledgement>
        <typeCode code="AA"/>
        <targetMessage>
          <id extension="200VGOV-387d3ca5-8074-4aaf-9bda-ed1aa8c83f58" root="1.2.840.114350.1.13.0.1.7.1.1"/>
        </targetMessage>
      </acknowledgement>
      <controlActProcess classCode="CACT" moodCode="EVN">
        <code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/>
        <subject typeCode="SUBJ">
          <registrationEvent classCode="REG" moodCode="EVN">
            <id nullFlavor="NA"/>
            <statusCode code="active"/>
            <subject1 typeCode="SBJ">
              <patient classCode="PAT">
                <id extension="12345678901234567^NI^200M^USVHA^P" root="2.16.840.1.113883.4.349"/>
                <id extension="12345678^PI^200CORP^USVBA^A" root="2.16.840.1.113883.4.349"/>
                <id extension="12345678901^PI^200MH^USVHA^U" root="2.16.840.1.113883.4.349"/>
                <id extension="12345678902^PI^200MH^USVHA^A" root="2.16.840.1.113883.4.349"/>
                <id extension="1122334455^NI^200DOD^USDOD^A" root="2.16.840.1.113883.3.42.10001.100001.12"/>
                <id extension="0001234567^PN^200PROV^USDVA^A" root="2.16.840.1.113883.4.349"/>
                <id extension="123412345^PI^200BRLS^USVBA^A" root="2.16.840.1.113883.4.349"/>
                <statusCode code="active"/>
                <patientPerson>
                  <name use="L">
                    <given>BENJAMIIN</given>
                    <given>TWO</given>
                    <family>CHESNEY</family>
                  </name>
                  <administrativeGenderCode code="M"/>
                  <birthTime value="19701231"/>
                  <asOtherIDs classCode="SSN">
                    <id extension="024018711" root="2.16.840.1.113883.4.1"/>
                    <scopingOrganization determinerCode="INSTANCE" classCode="ORG">
                      <id root="1.2.840.114350.1.13.99997.2.3412"/>
                    </scopingOrganization>
                  </asOtherIDs>
                </patientPerson>
                <subjectOf1>
                  <queryMatchObservation classCode="COND" moodCode="EVN">
                    <code code="IHE_PDQ"/>
                    <value nullFlavor="NA" xsi:type="INT"/>
                  </queryMatchObservation>
                </subjectOf1>
              </patient>
            </subject1>
            <custodian typeCode="CST">
              <assignedEntity classCode="ASSIGNED">
                <id root="2.16.840.1.113883.4.349"/>
              </assignedEntity>
            </custodian>
          </registrationEvent>
        </subject>
        <queryAck>
          <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
          <queryResponseCode code="OK"/>
          <resultCurrentQuantity value="1"/>
        </queryAck>
        <queryByParameter>
          <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
          <statusCode code="new"/>
          <modifyCode code="MVI.COMP2"/>
          <initialQuantity value="1"/>
          <parameterList>
            <id extension="1025062341" root="2.16.840.1.113883.3.42.10001.100001.12"/>
            <otherIDsScopingOrganization>
              <value extension="VBA" root="2.16.840.1.113883.4.349"/>
              <semanticsText>MVI.ORCHESTRATION</semanticsText>
            </otherIDsScopingOrganization>
          </parameterList>
        </queryByParameter>
      </controlActProcess>
    </idm:PRPA_IN201306UV02>
  </env:Body>
</env:Envelope>